---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendData.HookOrient1
source: html/ec8a9d7d-811e-1bbf-c764-6caf4f920c47.htm
---
# Autodesk.Revit.DB.Structure.RebarBendData.HookOrient1 Property

The orientation of the hook at the end.

## Syntax (C#)
```csharp
public RebarHookOrientation HookOrient1 { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration